export const titleText = [
    "사용자와의 채팅",
    "채점결과",
    "미제출 과제",
    "수업 내용 업로드",
    "수행평가",
    "학교 공지",
    "서비스 공지",
];

export const bodyText = [
    "다른 사용자와의 채팅이 오는 것을 알려줍니다.",
    "과제나 시험 등의 채점 결과가 등록되었을 때 알려줍니다.",
    "제출일까지 24시간 이내로 제출하지 않은 과제가 있으면 알림을 보냅니다.",
    "선생님께서 수업 자료나 내용을 새로 업로드했을 때 알려줍니다.",
    "선생님께서 수행평가를 새로 올렸을 때 알려줍니다.",
    "학교에서 발송한 공식 공지를 알려줍니다.",
    "서비스 이용에 관련된 공지사항을 전달합니다.",
];

export const Chats = [
    {
        name: "유근찬",
        lastMessage: "선생님 JAVA 하기 싫으면 어떻게 해야 하죠ㅠㅠ",
        lastDate: "2025-12-31",
        link: "/chat/1"
    },
    {
        name: "김민재",
        lastMessage: "글자제한은 어디까지 걸어야하는 지 너무 고민되는데 어디까지 걸어야...",
        lastDate: "2025-12-31",
        link: "/chat/2"
    },
    {
        name: "이도",
        lastMessage: "이번 주 과제 제출해야 하나요?",
        lastDate: "2025-12-30",
        link: "/chat/3"
    },
];